TorrusVR/Beacon/boards.txt
BBCmicrobit.menu.softdevice.s130=S130
BBCmicrobit.menu.softdevice.s130.softdevice=s130
BBCmicrobit.menu.softdevice.s130.softdeviceversion=2.0.1
BBCmicrobit.menu.softdevice.s130.upload.maximum_size=151552
BBCmicrobit.menu.softdevice.s130.build.extra_flags=-DNRF51 -DS130 -DNRF51_S130
BBCmicrobit.menu.softdevice.s130.build.ldscript=armgcc_s130_nrf51822_xxaa.ld


BluzDK.name=Bluz DK

BluzDK.upload.tool=sandeepmistry:openocd
BluzDK.upload.target=nrf51
BluzDK.upload.maximum_size=262144

BluzDK.bootloader.tool=sandeepmistry:openocd

BluzDK.build.mcu=cortex-m0
BluzDK.build.f_cpu=16000000
BluzDK.build.board=BLUZ_DK
BluzDK.build.core=nRF5
BluzDK.build.variant=BluzDK
BluzDK.build.variant_system_lib=
BluzDK.build.extra_flags=-DNRF51
BluzDK.build.float_flags=
BluzDK.build.ldscript=nrf51_xxac.ld

BluzDK.build.lfclk_flags=-DUSE_LFXO

BluzDK.menu.softdevice.none=None
BluzDK.menu.softdevice.none.softdevice=none

BluzDK.menu.softdevice.s110=S110
BluzDK.menu.softdevice.s110.softdevice=s110
BluzDK.menu.softdevice.s110.softdeviceversion=8.0.0
BluzDK.menu.softdevice.s110.upload.maximum_size=151552
BluzDK.menu.softdevice.s110.build.extra_flags=-DNRF51 -DS110 -DNRF51_S110
BluzDK.menu.softdevice.s110.build.ldscript=armgcc_s110_nrf51822_xxac.ld

BluzDK.menu.softdevice.s130=S130
BluzDK.menu.softdevice.s130.softdevice=s130
BluzDK.menu.softdevice.s130.softdeviceversion=2.0.1
BluzDK.menu.softdevice.s130.upload.maximum_size=151552
BluzDK.menu.softdevice.s130.build.extra_flags=-DNRF51 -DS130 -DNRF51_S130
BluzDK.menu.softdevice.s130.build.ldscript=armgcc_s130_nrf51822_xxac.ld


PCA1000X.name=Nordic nRF51X22 Development Kit(PCA1000X)

PCA1000X.upload.tool=sandeepmistry:openocd
PCA1000X.upload.target=nrf51
PCA1000X.upload.maximum_size=262144

PCA1000X.bootloader.tool=sandeepmistry:openocd

PCA1000X.build.mcu=cortex-m0
PCA1000X.build.f_cpu=16000000
PCA1000X.build.board=PCA1000X
PCA1000X.build.core=nRF5
PCA1000X.build.variant=PCA1000X
PCA1000X.build.variant_system_lib=
PCA1000X.build.extra_flags=-DNRF51 -D{board.variant}
PCA1000X.build.float_flags=
PCA1000X.build.ldscript=nrf51_xxaa.ld

PCA1000X.build.lfclk_flags=-DUSE_LFXO

PCA1000X.upload.tool=sandeepmistry:openocd
PCA1000X.upload.protocol=jlink
PCA1000X.upload.target=nrf51
PCA1000X.upload.maximum_size=262144
PCA1000X.upload.setup_command=transport select swd; set WORKAREASIZE 0;

PCA1000X.menu.board_variant.pca10000=PCA10000
PCA1000X.menu.board_variant.pca10000.board.variant=PCA10000
PCA1000X.menu.board_variant.nrf6310=PCA1000X (via nRF6310)
PCA1000X.menu.board_variant.nrf6310.board.variant=NRF6310

PCA1000X.menu.softdevice.none=None
PCA1000X.menu.softdevice.none.softdevice=none

PCA1000X.menu.softdevice.s110=S110
PCA1000X.menu.softdevice.s110.softdevice=s110
PCA1000X.menu.softdevice.s110.softdeviceversion=8.0.0
PCA1000X.menu.softdevice.s110.upload.maximum_size=151552
PCA1000X.menu.softdevice.s110.build.extra_flags=-DNRF51 -DS110 -DNRF51_S110
PCA1000X.menu.softdevice.s110.build.ldscript=armgcc_s110_nrf51822_xxaa.ld

PCA1000X.menu.softdevice.s130=S130
PCA1000X.menu.softdevice.s130.softdevice=s130
PCA1000X.menu.softdevice.s130.softdeviceversion=2.0.1
PCA1000X.menu.softdevice.s130.upload.maximum_size=151552
PCA1000X.menu.softdevice.s130.build.extra_flags=-DNRF51 -DS130 -DNRF51_S130
PCA1000X.menu.softdevice.s130.build.ldscript=armgcc_s130_nrf51822_xxaa.ld

PCA1000X.menu.lfclk.lfxo=Crystal Oscillator
PCA1000X.menu.lfclk.lfxo.build.lfclk_flags=-DUSE_LFXO
PCA1000X.menu.lfclk.lfrc=RC Oscillator
PCA1000X.menu.lfclk.lfrc.build.lfclk_flags=-DUSE_LFRC
PCA1000X.menu.lfclk.lfsynt=Synthesized
PCA1000X.menu.lfclk.lfsynt.build.lfclk_flags=-DUSE_LFSYNT


nRF51Dongle.name= Nordic nRF51 Dongle (PCA10031)

nRF51Dongle.upload.tool=sandeepmistry:openocd
nRF51Dongle.upload.protocol=cmsis-dap
nRF51Dongle.upload.target=nrf51
nRF51Dongle.upload.maximum_size=262144
nRF51Dongle.upload.setup_command=transport select swd;

nRF51Dongle.bootloader.tool=sandeepmistry:openocd

nRF51Dongle.build.mcu=cortex-m0
nRF51Dongle.build.f_cpu=16000000
nRF51Dongle.build.board=GENERIC
nRF51Dongle.build.core=nRF5
nRF51Dongle.build.variant=nRF51Dongle
nRF51Dongle.build.variant_system_lib=
nRF51Dongle.build.extra_flags=-DNRF51
nRF51Dongle.build.float_flags=
nRF51Dongle.build.ldscript=nrf51_{build.chip}.ld

nRF51Dongle.build.lfclk_flags=-DUSE_LFXO

nRF51Dongle.menu.version.1_1_0=1.1.0
nRF51Dongle.menu.version.1_1_0.build.chip=xxac

nRF51Dongle.menu.softdevice.none=None
nRF51Dongle.menu.softdevice.none.softdevice=none

nRF51Dongle.menu.softdevice.s110=S110
nRF51Dongle.menu.softdevice.s110.softdevice=s110
nRF51Dongle.menu.softdevice.s110.softdeviceversion=8.0.0
nRF51Dongle.menu.softdevice.s110.upload.maximum_size=151552
nRF51Dongle.menu.softdevice.s110.build.extra_flags=-DNRF51 -DS110 -DNRF51_S110
nRF51Dongle.menu.softdevice.s110.build.ldscript=armgcc_s110_nrf51822_{build.chip}.ld

nRF51Dongle.menu.softdevice.s130=S130
nRF51Dongle.menu.softdevice.s130.softdevice=s130
nRF51Dongle.menu.softdevice.s130.softdeviceversion=2.0.1
nRF51Dongle.menu.softdevice.s130.upload.maximum_size=151552
nRF51Dongle.menu.softdevice.s130.build.extra_flags=-DNRF51 -DS130 -DNRF51_S130
nRF51Dongle.menu.softdevice.s130.build.ldscript=armgcc_s130_nrf51822_{build.chip}.ld

Beacon_PCA20006.name=Nordic Beacon Kit (PCA20006)

Beacon_PCA20006.upload.tool=sandeepmistry:openocd
Beacon_PCA20006.upload.target=nrf51
Beacon_PCA20006.upload.maximum_size=262144

Beacon_PCA20006.bootloader.tool=sandeepmistry:openocd

Beacon_PCA20006.build.mcu=cortex-m0
Beacon_PCA20006.build.f_cpu=16000000
Beacon_PCA20006.build.board=BOARD_PCA20006
Beacon_PCA20006.build.core=nRF5
Beacon_PCA20006.build.variant=PCA20006
Beacon_PCA20006.build.variant_system_lib=
Beacon_PCA20006.build.extra_flags=-DNRF51
Beacon_PCA20006.build.float_flags=
Beacon_PCA20006.build.ldscript=nrf51_xxaa.ld

Beacon_PCA20006.build.lfclk_flags=-DUSE_LFXO

Beacon_PCA20006.menu.softdevice.none=None
Beacon_PCA20006.menu.softdevice.none.softdevice=none

Beacon_PCA20006.menu.softdevice.s110=S110
Beacon_PCA20006.menu.softdevice.s110.softdevice=s110
Beacon_PCA20006.menu.softdevice.s110.softdeviceversion=8.0.0
Beacon_PCA20006.menu.softdevice.s110.upload.maximum_size=151552
Beacon_PCA20006.menu.softdevice.s110.build.extra_flags=-DNRF51 -DS110 -DNRF51_S110 
Beacon_PCA20006.menu.softdevice.s110.build.ldscript=armgcc_s110_nrf51822_xxaa.ld

Beacon_PCA20006.menu.softdevice.s130=S130
Beacon_PCA20006.menu.softdevice.s130.softdevice=s130
Beacon_PCA20006.menu.softdevice.s130.softdeviceversion=2.0.1
Beacon_PCA20006.menu.softdevice.s130.upload.maximum_size=151552
Beacon_PCA20006.menu.softdevice.s130.build.extra_flags=-DNRF51 -DS130 -DNRF51_S130 
Beacon_PCA20006.menu.softdevice.s130.build.ldscript=armgcc_s130_nrf51822_xxaa.ld

TinyBLE.name= TinyBLE

TinyBLE.upload.tool=sandeepmistry:openocd
TinyBLE.upload.protocol=cmsis-dap

TinyBLE.upload.target=nrf51
TinyBLE.upload.maximum_size=262144
TinyBLE.upload.setup_command=transport select swd;

TinyBLE.bootloader.tool=sandeepmistry:openocd

TinyBLE.build.mcu=cortex-m0
TinyBLE.build.f_cpu=16000000
TinyBLE.build.board=TINYBLE
TinyBLE.build.core=nRF5
TinyBLE.build.variant=TinyBLE
TinyBLE.build.variant_system_lib=
TinyBLE.build.extra_flags=-DNRF51
TinyBLE.build.float_flags=
TinyBLE.build.ldscript=nrf51_xxaa.ld

TinyBLE.build.lfclk_flags=-DUSE_LFXO

TinyBLE.menu.softdevice.none=None
TinyBLE.menu.softdevice.none.softdevice=none

TinyBLE.menu.softdevice.s110=S110
TinyBLE.menu.softdevice.s110.softdevice=s110
TinyBLE.menu.softdevice.s110.softdeviceversion=8.0.0
TinyBLE.menu.softdevice.s110.upload.maximum_size=151552
TinyBLE.menu.softdevice.s110.build.extra_flags=-DNRF51 -DS110 -DNRF51_S110
TinyBLE.menu.softdevice.s110.build.ldscript=armgcc_s110_nrf51822_xxaa.ld

TinyBLE.menu.softdevice.s130=S130
TinyBLE.menu.softdevice.s130.softdevice=s130
TinyBLE.menu.softdevice.s130.softdeviceversion=2.0.1
TinyBLE.menu.softdevice.s130.upload.maximum_size=151552
TinyBLE.menu.softdevice.s130.build.extra_flags=-DNRF51 -DS130 -DNRF51_S130
TinyBLE.menu.softdevice.s130.build.ldscript=armgcc_s130_nrf51822_xxaa.ld


