TorrusVR/Beacon/boards.txt
ng_beacon.build.mcu=cortex-m0
ng_beacon.build.f_cpu=16000000
ng_beacon.build.board=NG_BEACON
ng_beacon.build.core=nRF5
ng_beacon.build.variant=ng-beacon
ng_beacon.build.variant_system_lib=
ng_beacon.build.extra_flags=-DNRF51
ng_beacon.build.float_flags=
ng_beacon.build.ldscript=nrf51_xxaa.ld

ng_beacon.build.lfclk_flags=-DUSE_LFRC

ng_beacon.menu.softdevice.none=None
ng_beacon.menu.softdevice.none.softdevice=none

ng_beacon.menu.softdevice.s110=S110
ng_beacon.menu.softdevice.s110.softdevice=s110
ng_beacon.menu.softdevice.s110.softdeviceversion=8.0.0
ng_beacon.menu.softdevice.s110.upload.maximum_size=151552
ng_beacon.menu.softdevice.s110.build.extra_flags=-DNRF51 -DS110 -DNRF51_S110
ng_beacon.menu.softdevice.s110.build.ldscript=armgcc_s110_nrf51822_xxaa.ld

ng_beacon.menu.softdevice.s130=S130
ng_beacon.menu.softdevice.s130.softdevice=s130
ng_beacon.menu.softdevice.s130.softdeviceversion=2.0.1
ng_beacon.menu.softdevice.s130.upload.maximum_size=151552
ng_beacon.menu.softdevice.s130.build.extra_flags=-DNRF51 -DS130 -DNRF51_S130
ng_beacon.menu.softdevice.s130.build.ldscript=armgcc_s130_nrf51822_xxaa.ld



nRF52840DK.name=nRF52840 DK

nRF52840DK.vid.0=0x1366
nRF52840DK.pid.0=0x1015

nRF52840DK.upload.tool=sandeepmistry:openocd
nRF52840DK.upload.protocol= jlink
nRF52840DK.upload.interface=jlink
nRF52840DK.upload.target=nrf52
nRF52840DK.upload.maximum_size=524288
nRF52840DK.upload.setup_command=transport select swd;
nRF52840DK.upload.use_1200bps_touch=false
nRF52840DK.upload.wait_for_upload_port=false
nRF52840DK.upload.native_usb=false

nRF52840DK.bootloader.tool=sandeepmistry:openocd

nRF52840DK.build.mcu=cortex-m4
nRF52840DK.build.f_cpu=16000000
nRF52840DK.build.board=NRF52840_DK
nRF52840DK.build.core=nRF5
nRF52840DK.build.variant=nRF52840DK
nRF52840DK.build.variant_system_lib=
nRF52840DK.build.extra_flags=-DNRF52 -DNRF52840 -DNRF52840_XXAA
nRF52840DK.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
nRF52840DK.build.ldscript=nrf52_xxaa.ld

nRF52840DK.menu.softdevice.none=None
nRF52840DK.menu.softdevice.none.softdevice=none

nRF52840DK.menu.softdevice.s140=s140
nRF52840DK.menu.softdevice.s140.softdevice=s140
nRF52840DK.menu.softdevice.s140.softdeviceversion=2.0.1
nRF52840DK.menu.softdevice.s140.upload.maximum_size=409600
nRF52840DK.menu.softdevice.s140.build.extra_flags=-DNRF52 -DS140 -DNRF51_S140 -DNRF52840 -DNRF52840_XXAA
nRF52840DK.menu.softdevice.s140.build.ldscript=armgcc_s140_nrf52832_xxaa.ld

nRF52840DK.menu.lfclk.lfxo=Crystal Oscillator
nRF52840DK.menu.lfclk.lfxo.build.lfclk_flags=-DUSE_LFXO
nRF52840DK.menu.lfclk.lfrc=RC Oscillator
nRF52840DK.menu.lfclk.lfrc.build.lfclk_flags=-DUSE_LFRC
nRF52840DK.menu.lfclk.lfsynt=Synthesized
nRF52840DK.menu.lfclk.lfsynt.build.lfclk_flags=-DUSE_LFSYNT
